read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog dff.v
synth -top dff
dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
write_verilog -noattr dff_netlist.v
tee -o dff.rpt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
write_json dff.json
show -prefix ./dff.netlist -format jpeg
#!dot -Tpng netlist.dot -o netlist.png
!netlistsvg dff.json -o dff.svg