read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog alu.v
synth -top alu
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
write_verilog -noattr alu_netlist.v
write_json alu.json
tee -o alu.rpt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
show -prefix ./alu.netlist -format jpeg
!netlistsvg alu.json -o alu.svg
#!dot -Tpng netlist.dot -o netlist.png